espressif/esp-idf/components/soc/esp32s31/register/soc/zero_det_reg.h
/** ZERO_DET_INT_CLR_REG register
 *  zero det int clr
 */
#define ZERO_DET_INT_CLR_REG (DR_REG_ZERO_DET_BASE + 0x18)
/** ZERO_DET_PAD_COMP_CHANNEL_3_NEG_INT_CLR : WT; bitpos: [0]; default: 0;
 *  reserved
 */
#define ZERO_DET_PAD_COMP_CHANNEL_3_NEG_INT_CLR    (BIT(0))
#define ZERO_DET_PAD_COMP_CHANNEL_3_NEG_INT_CLR_M  (ZERO_DET_PAD_COMP_CHANNEL_3_NEG_INT_CLR_V << ZERO_DET_PAD_COMP_CHANNEL_3_NEG_INT_CLR_S)
#define ZERO_DET_PAD_COMP_CHANNEL_3_NEG_INT_CLR_V  0x00000001U
#define ZERO_DET_PAD_COMP_CHANNEL_3_NEG_INT_CLR_S  0
/** ZERO_DET_PAD_COMP_CHANNEL_3_POS_INT_CLR : WT; bitpos: [1]; default: 0;
 *  reserved
 */
#define ZERO_DET_PAD_COMP_CHANNEL_3_POS_INT_CLR    (BIT(1))
#define ZERO_DET_PAD_COMP_CHANNEL_3_POS_INT_CLR_M  (ZERO_DET_PAD_COMP_CHANNEL_3_POS_INT_CLR_V << ZERO_DET_PAD_COMP_CHANNEL_3_POS_INT_CLR_S)
#define ZERO_DET_PAD_COMP_CHANNEL_3_POS_INT_CLR_V  0x00000001U
#define ZERO_DET_PAD_COMP_CHANNEL_3_POS_INT_CLR_S  1
/** ZERO_DET_PAD_COMP_CHANNEL_3_INT_CLR : WT; bitpos: [2]; default: 0;
 *  reserved
 */
#define ZERO_DET_PAD_COMP_CHANNEL_3_INT_CLR    (BIT(2))
#define ZERO_DET_PAD_COMP_CHANNEL_3_INT_CLR_M  (ZERO_DET_PAD_COMP_CHANNEL_3_INT_CLR_V << ZERO_DET_PAD_COMP_CHANNEL_3_INT_CLR_S)
#define ZERO_DET_PAD_COMP_CHANNEL_3_INT_CLR_V  0x00000001U
#define ZERO_DET_PAD_COMP_CHANNEL_3_INT_CLR_S  2
/** ZERO_DET_PAD_COMP_CHANNEL_2_NEG_INT_CLR : WT; bitpos: [3]; default: 0;
 *  reserved
 */
#define ZERO_DET_PAD_COMP_CHANNEL_2_NEG_INT_CLR    (BIT(3))
#define ZERO_DET_PAD_COMP_CHANNEL_2_NEG_INT_CLR_M  (ZERO_DET_PAD_COMP_CHANNEL_2_NEG_INT_CLR_V << ZERO_DET_PAD_COMP_CHANNEL_2_NEG_INT_CLR_S)
#define ZERO_DET_PAD_COMP_CHANNEL_2_NEG_INT_CLR_V  0x00000001U
#define ZERO_DET_PAD_COMP_CHANNEL_2_NEG_INT_CLR_S  3
/** ZERO_DET_PAD_COMP_CHANNEL_2_POS_INT_CLR : WT; bitpos: [4]; default: 0;
 *  reserved
 */
#define ZERO_DET_PAD_COMP_CHANNEL_2_POS_INT_CLR    (BIT(4))
#define ZERO_DET_PAD_COMP_CHANNEL_2_POS_INT_CLR_M  (ZERO_DET_PAD_COMP_CHANNEL_2_POS_INT_CLR_V << ZERO_DET_PAD_COMP_CHANNEL_2_POS_INT_CLR_S)
#define ZERO_DET_PAD_COMP_CHANNEL_2_POS_INT_CLR_V  0x00000001U
#define ZERO_DET_PAD_COMP_CHANNEL_2_POS_INT_CLR_S  4
/** ZERO_DET_PAD_COMP_CHANNEL_2_INT_CLR : WT; bitpos: [5]; default: 0;
 *  reserved
 */
#define ZERO_DET_PAD_COMP_CHANNEL_2_INT_CLR    (BIT(5))
#define ZERO_DET_PAD_COMP_CHANNEL_2_INT_CLR_M  (ZERO_DET_PAD_COMP_CHANNEL_2_INT_CLR_V << ZERO_DET_PAD_COMP_CHANNEL_2_INT_CLR_S)
#define ZERO_DET_PAD_COMP_CHANNEL_2_INT_CLR_V  0x00000001U
#define ZERO_DET_PAD_COMP_CHANNEL_2_INT_CLR_S  5
/** ZERO_DET_PAD_COMP_CHANNEL_1_NEG_INT_CLR : WT; bitpos: [6]; default: 0;
 *  reserved
 */
#define ZERO_DET_PAD_COMP_CHANNEL_1_NEG_INT_CLR    (BIT(6))
#define ZERO_DET_PAD_COMP_CHANNEL_1_NEG_INT_CLR_M  (ZERO_DET_PAD_COMP_CHANNEL_1_NEG_INT_CLR_V << ZERO_DET_PAD_COMP_CHANNEL_1_NEG_INT_CLR_S)
#define ZERO_DET_PAD_COMP_CHANNEL_1_NEG_INT_CLR_V  0x00000001U
#define ZERO_DET_PAD_COMP_CHANNEL_1_NEG_INT_CLR_S  6
/** ZERO_DET_PAD_COMP_CHANNEL_1_POS_INT_CLR : WT; bitpos: [7]; default: 0;
 *  reserved
 */
#define ZERO_DET_PAD_COMP_CHANNEL_1_POS_INT_CLR    (BIT(7))
#define ZERO_DET_PAD_COMP_CHANNEL_1_POS_INT_CLR_M  (ZERO_DET_PAD_COMP_CHANNEL_1_POS_INT_CLR_V << ZERO_DET_PAD_COMP_CHANNEL_1_POS_INT_CLR_S)
#define ZERO_DET_PAD_COMP_CHANNEL_1_POS_INT_CLR_V  0x00000001U
#define ZERO_DET_PAD_COMP_CHANNEL_1_POS_INT_CLR_S  7
/** ZERO_DET_PAD_COMP_CHANNEL_1_INT_CLR : WT; bitpos: [8]; default: 0;
 *  reserved
 */
#define ZERO_DET_PAD_COMP_CHANNEL_1_INT_CLR    (BIT(8))
#define ZERO_DET_PAD_COMP_CHANNEL_1_INT_CLR_M  (ZERO_DET_PAD_COMP_CHANNEL_1_INT_CLR_V << ZERO_DET_PAD_COMP_CHANNEL_1_INT_CLR_S)
#define ZERO_DET_PAD_COMP_CHANNEL_1_INT_CLR_V  0x00000001U
#define ZERO_DET_PAD_COMP_CHANNEL_1_INT_CLR_S  8
/** ZERO_DET_PAD_COMP_NEG_INT_CLR : WT; bitpos: [9]; default: 0;
 *  reserved
 */
#define ZERO_DET_PAD_COMP_NEG_INT_CLR    (BIT(9))
#define ZERO_DET_PAD_COMP_NEG_INT_CLR_M  (ZERO_DET_PAD_COMP_NEG_INT_CLR_V << ZERO_DET_PAD_COMP_NEG_INT_CLR_S)
#define ZERO_DET_PAD_COMP_NEG_INT_CLR_V  0x00000001U
#define ZERO_DET_PAD_COMP_NEG_INT_CLR_S  9
/** ZERO_DET_PAD_COMP_POS_INT_CLR : WT; bitpos: [10]; default: 0;
 *  reserved
 */
#define ZERO_DET_PAD_COMP_POS_INT_CLR    (BIT(10))
#define ZERO_DET_PAD_COMP_POS_INT_CLR_M  (ZERO_DET_PAD_COMP_POS_INT_CLR_V << ZERO_DET_PAD_COMP_POS_INT_CLR_S)
#define ZERO_DET_PAD_COMP_POS_INT_CLR_V  0x00000001U
#define ZERO_DET_PAD_COMP_POS_INT_CLR_S  10
/** ZERO_DET_PAD_COMP_INT_CLR : WT; bitpos: [11]; default: 0;
 *  reserved
 */
#define ZERO_DET_PAD_COMP_INT_CLR    (BIT(11))
#define ZERO_DET_PAD_COMP_INT_CLR_M  (ZERO_DET_PAD_COMP_INT_CLR_V << ZERO_DET_PAD_COMP_INT_CLR_S)
#define ZERO_DET_PAD_COMP_INT_CLR_V  0x00000001U
#define ZERO_DET_PAD_COMP_INT_CLR_S  11

/** ZERO_DET_INT_ST_REG register
 *  zero det int st
 */
#define ZERO_DET_INT_ST_REG (DR_REG_ZERO_DET_BASE + 0x1c)
/** ZERO_DET_PAD_COMP_CHANNEL_3_NEG_INT_ST : RO; bitpos: [0]; default: 0;
 *  reserved
 */
#define ZERO_DET_PAD_COMP_CHANNEL_3_NEG_INT_ST    (BIT(0))
#define ZERO_DET_PAD_COMP_CHANNEL_3_NEG_INT_ST_M  (ZERO_DET_PAD_COMP_CHANNEL_3_NEG_INT_ST_V << ZERO_DET_PAD_COMP_CHANNEL_3_NEG_INT_ST_S)
#define ZERO_DET_PAD_COMP_CHANNEL_3_NEG_INT_ST_V  0x00000001U
#define ZERO_DET_PAD_COMP_CHANNEL_3_NEG_INT_ST_S  0
/** ZERO_DET_PAD_COMP_CHANNEL_3_POS_INT_ST : RO; bitpos: [1]; default: 0;
 *  reserved
 */
#define ZERO_DET_PAD_COMP_CHANNEL_3_POS_INT_ST    (BIT(1))
#define ZERO_DET_PAD_COMP_CHANNEL_3_POS_INT_ST_M  (ZERO_DET_PAD_COMP_CHANNEL_3_POS_INT_ST_V << ZERO_DET_PAD_COMP_CHANNEL_3_POS_INT_ST_S)
#define ZERO_DET_PAD_COMP_CHANNEL_3_POS_INT_ST_V  0x00000001U
#define ZERO_DET_PAD_COMP_CHANNEL_3_POS_INT_ST_S  1
/** ZERO_DET_PAD_COMP_CHANNEL_3_INT_ST : RO; bitpos: [2]; default: 0;
 *  reserved
 */
#define ZERO_DET_PAD_COMP_CHANNEL_3_INT_ST    (BIT(2))
#define ZERO_DET_PAD_COMP_CHANNEL_3_INT_ST_M  (ZERO_DET_PAD_COMP_CHANNEL_3_INT_ST_V << ZERO_DET_PAD_COMP_CHANNEL_3_INT_ST_S)
#define ZERO_DET_PAD_COMP_CHANNEL_3_INT_ST_V  0x00000001U
#define ZERO_DET_PAD_COMP_CHANNEL_3_INT_ST_S  2
/** ZERO_DET_PAD_COMP_CHANNEL_2_NEG_INT_ST : RO; bitpos: [3]; default: 0;
 *  reserved
 */
#define ZERO_DET_PAD_COMP_CHANNEL_2_NEG_INT_ST    (BIT(3))
#define ZERO_DET_PAD_COMP_CHANNEL_2_NEG_INT_ST_M  (ZERO_DET_PAD_COMP_CHANNEL_2_NEG_INT_ST_V << ZERO_DET_PAD_COMP_CHANNEL_2_NEG_INT_ST_S)
#define ZERO_DET_PAD_COMP_CHANNEL_2_NEG_INT_ST_V  0x00000001U
#define ZERO_DET_PAD_COMP_CHANNEL_2_NEG_INT_ST_S  3
/** ZERO_DET_PAD_COMP_CHANNEL_2_POS_INT_ST : RO; bitpos: [4]; default: 0;
 *  reserved
 */
#define ZERO_DET_PAD_COMP_CHANNEL_2_POS_INT_ST    (BIT(4))
#define ZERO_DET_PAD_COMP_CHANNEL_2_POS_INT_ST_M  (ZERO_DET_PAD_COMP_CHANNEL_2_POS_INT_ST_V << ZERO_DET_PAD_COMP_CHANNEL_2_POS_INT_ST_S)
#define ZERO_DET_PAD_COMP_CHANNEL_2_POS_INT_ST_V  0x00000001U
#define ZERO_DET_PAD_COMP_CHANNEL_2_POS_INT_ST_S  4
/** ZERO_DET_PAD_COMP_CHANNEL_2_INT_ST : RO; bitpos: [5]; default: 0;
 *  reserved
 */
#define ZERO_DET_PAD_COMP_CHANNEL_2_INT_ST    (BIT(5))
#define ZERO_DET_PAD_COMP_CHANNEL_2_INT_ST_M  (ZERO_DET_PAD_COMP_CHANNEL_2_INT_ST_V << ZERO_DET_PAD_COMP_CHANNEL_2_INT_ST_S)
#define ZERO_DET_PAD_COMP_CHANNEL_2_INT_ST_V  0x00000001U
#define ZERO_DET_PAD_COMP_CHANNEL_2_INT_ST_S  5
/** ZERO_DET_PAD_COMP_CHANNEL_1_NEG_INT_ST : RO; bitpos: [6]; default: 0;
 *  reserved
 */
#define ZERO_DET_PAD_COMP_CHANNEL_1_NEG_INT_ST    (BIT(6))
#define ZERO_DET_PAD_COMP_CHANNEL_1_NEG_INT_ST_M  (ZERO_DET_PAD_COMP_CHANNEL_1_NEG_INT_ST_V << ZERO_DET_PAD_COMP_CHANNEL_1_NEG_INT_ST_S)
#define ZERO_DET_PAD_COMP_CHANNEL_1_NEG_INT_ST_V  0x00000001U
#define ZERO_DET_PAD_COMP_CHANNEL_1_NEG_INT_ST_S  6
/** ZERO_DET_PAD_COMP_CHANNEL_1_POS_INT_ST : RO; bitpos: [7]; default: 0;
 *  reserved
 */
#define ZERO_DET_PAD_COMP_CHANNEL_1_POS_INT_ST    (BIT(7))
#define ZERO_DET_PAD_COMP_CHANNEL_1_POS_INT_ST_M  (ZERO_DET_PAD_COMP_CHANNEL_1_POS_INT_ST_V << ZERO_DET_PAD_COMP_CHANNEL_1_POS_INT_ST_S)
#define ZERO_DET_PAD_COMP_CHANNEL_1_POS_INT_ST_V  0x00000001U
#define ZERO_DET_PAD_COMP_CHANNEL_1_POS_INT_ST_S  7
/** ZERO_DET_PAD_COMP_CHANNEL_1_INT_ST : RO; bitpos: [8]; default: 0;
 *  reserved
 */
#define ZERO_DET_PAD_COMP_CHANNEL_1_INT_ST    (BIT(8))
#define ZERO_DET_PAD_COMP_CHANNEL_1_INT_ST_M  (ZERO_DET_PAD_COMP_CHANNEL_1_INT_ST_V << ZERO_DET_PAD_COMP_CHANNEL_1_INT_ST_S)
#define ZERO_DET_PAD_COMP_CHANNEL_1_INT_ST_V  0x00000001U
#define ZERO_DET_PAD_COMP_CHANNEL_1_INT_ST_S  8
/** ZERO_DET_PAD_COMP_NEG_INT_ST : RO; bitpos: [9]; default: 0;
 *  reserved
 */
#define ZERO_DET_PAD_COMP_NEG_INT_ST    (BIT(9))
#define ZERO_DET_PAD_COMP_NEG_INT_ST_M  (ZERO_DET_PAD_COMP_NEG_INT_ST_V << ZERO_DET_PAD_COMP_NEG_INT_ST_S)
#define ZERO_DET_PAD_COMP_NEG_INT_ST_V  0x00000001U
#define ZERO_DET_PAD_COMP_NEG_INT_ST_S  9
/** ZERO_DET_PAD_COMP_POS_INT_ST : RO; bitpos: [10]; default: 0;
 *  reserved
 */
#define ZERO_DET_PAD_COMP_POS_INT_ST    (BIT(10))
#define ZERO_DET_PAD_COMP_POS_INT_ST_M  (ZERO_DET_PAD_COMP_POS_INT_ST_V << ZERO_DET_PAD_COMP_POS_INT_ST_S)
#define ZERO_DET_PAD_COMP_POS_INT_ST_V  0x00000001U
#define ZERO_DET_PAD_COMP_POS_INT_ST_S  10
/** ZERO_DET_PAD_COMP_INT_ST : RO; bitpos: [11]; default: 0;
 *  reserved
 */
#define ZERO_DET_PAD_COMP_INT_ST    (BIT(11))
#define ZERO_DET_PAD_COMP_INT_ST_M  (ZERO_DET_PAD_COMP_INT_ST_V << ZERO_DET_PAD_COMP_INT_ST_S)
#define ZERO_DET_PAD_COMP_INT_ST_V  0x00000001U
#define ZERO_DET_PAD_COMP_INT_ST_S  11

